greetings = """
<b>Салют. Этот бот создан в качестве помощника для пользователей сервиса.</b>
Чтобы увидеть список доступных команд начни вводить в чате / или воспользуйся кнопкой Меню в мобильной версии.
"""

information_text = """
Софт крайне похож по принципу действия на классический VPN, но в отличии от него <b>использует продвинутую технологию 
Shadowsoks, которая активно используется в Китае, потому что позволяет обходить 'великий китайский фаерволл', в отличие
от многих других решений.</b>

Также важно понимать, что <b>у любого стандартного VPN остается сигнатурный след</b>, собственно через него РКН и ведет 
борьбу с VPN сервисами, а вот программы работающие на основе технологии Shadowsocks <b>очень сложно отследить и 
заблокировать</b>, а все благодаря маскировке трафика под HTTPS.
"""

download_text = """
Для того чтобы начать пользоваться VPN необходимо перейти по ссылке ниже, скачать и установить <b>программу-клиент❗</b>, 
после перехода по ссылке, пролистывайте открывшуюся страницу вниз (там будут ссылки для всех платформ).
 
https://getoutline.org/ru/get-started/#step-3

После прейдите в раздел "Оплата", после осуществления перевода, бот пришлет вам уникальный ключ для подключения, 
вставляете его в программе-клиенте, подключаетесь к серверу и вуаля вы в свободном интернете. Данный ключ можно 
использовать на всех ваших устройствах.
"""

important_info_text = """
<b>Несколько важных моментов.</b> 

Если вдруг законодательство  РФ в отношении систем обхода блокировок изменится, с большой долей вероятности проект будет
закрыт.

<b>Этот проект не предназначен для использования в коммерческих целях</b>, что это значит. 
Если вы хотите на это сервак подключить свой офис, то эта движуха не для вас. 
Надо понимать что возможности сервера рассчитаны только для личного пользования, 
<b>высокая нагрузка повлияет на всех пользователей !!!</b> 
Если вы думаете, что у вас получится схитрить, то нет, не получится, 
в технические подробности вдаваться не хочу, просто поверьте.

<b>Ключ доступа предоставляется для пользования одному человеку на всех его устройствах.</b> 

<b>Сервис запущен для свободного  доступа к интернету, а не для нарушения законодательства. 
Поэтому не стоит через него покупать то, чего нет в открытой продаже. Этими действиями вы подставляете не только себя 
но и меня.</b>

Кроме того рекомендую не удалять VPN сервис которым вы пользовались до этого. 
Он может вам пригодится для доступа к интернету в случае, если это сервис будет недоступен 
из-за каких-либо критических ситуаций (благо пока такого не случалось).

<b>Помните что VPN — это средство приватности, но не средство анонимности.</b> Для анонимности используйте, например 
связку VPN + Tor — это, в принципе, довольно неплохой вариант,<b> но далеко не идеальный.</b> Не надо расслабляться и 
забывать о безопасности, занимайтесь самообразованием, читайте про безопасность и анонимность в сети.  🕊
"""

payments_text = """
<b>Сумма взноса составляет 300 руб в месяц</b>. В будущем сумма может изменится.

Перевод необходимо сделать через СБП, по номеру телефона. 

Принцип оплаты такой: если вы начали пользоваться сервером 23 числа, то все последующие переводы нужно осуществлять за 
минусом одного дня, иными словами не позднее 22 числа. В противном случае, ваш ключ доступа будет анулирован.
"""

help_text = "Если возникли вопросы, то наша поддержка на связи в боте @Butter_robot_supportBot"

payment_notice_text = """
Ваша подписка закончится <b>{}</b>. За три дня до окончания срока действия подписки <b>({})</b> бот пришлет вам 
напоминание об оплате. Денежные средства нужно внести <b>не позднее чем за день</b> до срока окончания подписки.
"""

how_to_pay_text = f""" 
Необходимо через <b>СБП на номер</b> <span class="tg-spoiler">89823125048</span> <b>(банк БКС) перевести 300 рублей</b>, 
после чего прислать скриншот с переводом денежных средств в чат с этим ботом <b>(обращаю внимание что это должно быть 
именно фото, а не документ!)</b>. Спустя некоторое время бот пришлет вам ссылку для подключения к сервису. Если возникли 
проблемы напишите в поддержку @Butter_robot_supportBot
"""

how_to_pay_subscriber = """ 
Необходимо через <b>СБП на номер</b> <span class="tg-spoiler">89823125048</span> <b>(банк БКС) перевести 300 рублей</b>, 
после чего прислать скриншот с переводом денежных средств в чат с этим ботом <b>(обращаю внимание что это должно быть 
именно фото, а не документ!)</b>. Если возникли проблемы напишите в поддержку @Butter_robot_supportBot
"""

text_for_new_link = """
Подписка успешно оформлена. 

Ключ для подключения находится в сообщении ниже. В приложении (клиенте) Outline нажмите на значок плюса "+" вверху 
экрана и вставьте скопированный ключ доступа.
"""
